# Pandas

# Data Series

1. Write a Pandas program to create and display a one-dimensional array-like object containing an array of data using Pandas module.

In [2]:
import pandas as pd
ds = pd.Series([2,4,6,8,10])
print(ds)

0     2
1     4
2     6
3     8
4    10
dtype: int64

2. Write a Pandas program to convert a Panda module Series to Python list and itâ€™s type.

In [5]:
ds = pd.Series([2,4,6,8,10])
print(type(ds))
ls = list(ds)
print(type(ls))
print(ls)

<class 'pandas.core.series.Series'>
<class 'list'>
[2, 4, 6, 8, 10]

3. Write a Pandas program to add, subtract, multiple and divide two Pandas Series.

In [8]:
ds1 = pd.Series([2,4,6,8,10])
ds2 = pd.Series([1,3,5,7,9])
print(ds1-ds2)
print(ds1+ds2)
print(ds1*ds2)

0    1
1    1
2    1
3    1
4    1
dtype: int64
0     3
1     7
2    11
3    15
4    19
dtype: int64
0     2
1    12
2    30
3    56
4    90
dtype: int64

4. Write a Pandas program to convert a dictionary to a Pandas series.

In [10]:
d1 = {'a': 100, 'b': 200, 'c':300, 'd':400, 'e':800}
print(d1)
print("Data Series: ")
ds = pd.Series(d1)
print(ds)

{'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
Data Series:
a    100
b    200
c    300
d    400
e    800
dtype: int64

5. Write a Pandas program to sort a given Series.

In [11]:
s = pd.Series(['100', '200', 'python', '300.12', '400'])

new_s = pd.Series(s).sort_values()
print(new_s)

0       100
1       200
3    300.12
4       400
2    python
dtype: object

6. Write a Pandas program to create a subset of a given series based on value and condition.

In [15]:
import numpy as np
s = pd.Series(np.arange(11))
s[s<6]

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

7. Write a Pandas program to change the order of index of a given series.

In [17]:
s = pd.Series([1,2,3,4,5], ['A', 'B', 'C', 'D', 'E'])
s = s.reindex(['B', 'A','C', 'E', 'D'])
s

B    2
A    1
C    3
E    5
D    4
dtype: int64

8. Write a Pandas program to create the mean and standard deviation of the data of a given Series.

In [22]:
s = pd.Series(np.arange(1, 11))
mean = s.mean()
sd = s.std()
print(mean)
print(sd)

5.5
3.0276503540974917

9. Write a Pandas program to compute the minimum, 25th percentile, median, 75th, and maximum of a given series.

In [27]:
s = pd.Series(np.random.rand(20))
percentile = np.percentile(s, [0, 25, 50, 75, 100])
print(percentile)

[0.09107576 0.21060752 0.43923535 0.74883803 0.94513624]

In [31]:
s = pd.Series(np.random.randint(1, 11, size=15))
res = s.value_counts()
print(res)

4     4
3     3
8     2
9     2
7     1
2     1
1     1
10    1
dtype: int64

# DataFrame

1. Write a Pandas program to get the powers of an array values element-wise.

In [32]:
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]})
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

2. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

In [3]:
import numpy as np
df = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}, 
index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

print(df.head(3))

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

3. Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.

In [43]:
print(df[['name', 'score']])

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

4. Write a Pandas program to select the specified columns and rows from a given DataFrame.
Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.

In [47]:
print(df.iloc[[1,3,5,6], [0,1]])

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

5. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.

In [49]:
print(df[df.attempts>2])

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

6. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

In [6]:
import pandas as pd
print(df[df.score.isnull()])

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

7. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).

In [10]:
print(df[df.score.between(15, 21)])

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

8. Write a Pandas program to change the score in row 'd' to 11.5

In [14]:
print(df.score[df.index=='d'])
df.score[df.index=='d'] = 11.5
print(df.score[df.index=='d'])

d    15.5
Name: score, dtype: float64
d    11.5
Name: score, dtype: float64

/var/folders/tv/ht5p64_j1g9_lk9jm4j_zrsh0000gn/T/ipykernel_15862/2823681168.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.score[df.index=='d'] = 11.5

9. Write a Pandas program to calculate the sum of the examination attempts by the students.

In [16]:
print(df.attempts.sum())
print(df.score.mean())

19
13.333333333333334

10. Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.

In [23]:
df.loc['k'] = ['Suresh', 15.5, 1, 'yes']
print(df)
df.drop('k')

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

16. Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.

In [28]:
print(df.sort_values(['name', 'score'], ascending=[False, True]))

        name  score  attempts qualify
k     Suresh   15.5         1     yes
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

17. Write a Pandas program to get list from DataFrame column headers.

In [29]:
print(df.columns)

Index(['name', 'score', 'attempts', 'qualify'], dtype='object')

18. Write a Pandas program to rename columns of a given DataFrame

In [41]:
arr = np.arange(0, 16)
arr = arr.reshape((4,4))

df = pd.DataFrame(arr, columns=[1, 2, 3, 4])
df.columns = ['a', 'b', 'c', 'd']
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

19. Write a Pandas program to write a DataFrame to CSV file using tab separator.

In [48]:
df.to_csv('new.csv', sep='_', index=False)
df2 = pd.read_csv('new.csv', sep="_")
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

20. Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.

In [53]:
data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

df = pd.DataFrame(data)
df = df.fillna(0)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes